iarsystems/ewarm-toshiba-example-projects/TMPM4KN/Libraries/CMSIS/startup/iar/startup_TMPM4KN.s
;/**
; *******************************************************************************
; * @file    startup_TMPM4KN.s
; * @brief   CMSIS Cortex-M4 Core Device Startup File for the
; *          TOSHIBA 'TMPM4KN' Device Series
; * @version V1.0.1.0
; * $Date::            #$
; * 
; * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
; * 
; * (C)Copyright TOSHIBA MICROELECTRONICS CORPORATION 2019 All rights reserved
; *******************************************************************************
; */
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; Cortex-M version
;

                MODULE  ?cstartup

                ;; Forward declaration of sections.
                SECTION CSTACK:DATA:NOROOT(3)

                SECTION .intvec:CODE:NOROOT(2)

                EXTERN  __iar_program_start
                EXTERN  SystemInit
                PUBLIC  __vector_table

                DATA
__vector_table  DCD     sfe(CSTACK)
                DCD     Reset_Handler

                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     INT00_IRQHandler          ; 0:	Interrupt pin 00
                DCD     INT01_IRQHandler          ; 1:	Interrupt pin 01a/00b
                DCD     INT02_IRQHandler          ; 2:	Interrupt pin 02a/00b
                DCD     INT03_IRQHandler          ; 3:	Interrupt pin 03a/03b
                DCD     INT04_IRQHandler          ; 4:	Interrupt pin 04a/04b
                DCD     INT05_IRQHandler          ; 5:	Interrupt pin 05a/05b
                DCD     INT06_IRQHandler          ; 6:	Interrupt pin 06a/06b
                DCD     INT07_IRQHandler          ; 7:	Interrupt pin 07a/07b
                DCD     INT08_IRQHandler          ; 8:	Interrupt pin 08a/08b
                DCD     INT09_IRQHandler          ; 9:	Interrupt pin 09
                DCD     INT10_IRQHandler          ; 10:	Interrupt pin 10
                DCD     INT11_IRQHandler          ; 11:	Interrupt pin 11a/11b
                DCD     INT12_IRQHandler          ; 12:	Interrupt pin 12
                DCD     INT13_IRQHandler          ; 13:	Interrupt pin 13
                DCD     INT14_IRQHandler          ; 14:	Interrupt pin 14a/14b
                DCD     INT15_IRQHandler          ; 15:	Interrupt pin 15
                DCD     INT16_IRQHandler          ; 16:	Interrupt pin 16a/16b
                DCD     INT17_IRQHandler          ; 17:	Interrupt pin 17a/17b
                DCD     INT18_IRQHandler          ; 18:	Interrupt pin 18a/18b
                DCD     0                         ; 19:	Reserved
                DCD     0                         ; 20:	Reserved
                DCD     INT21_IRQHandler          ; 21:	Interrupt pin 21
                DCD     INTVCN0_IRQHandler        ; 22:	A-VE+ ch0 interrupt
                DCD     INTVCT0_IRQHandler        ; 23:	A-VE+ ch0 task termination interrupt
                DCD     INTEMG0_IRQHandler        ; 24:	A-PMD ch0 EMG interrupt
                DCD     INTEMG1_IRQHandler        ; 25:	A-PMD ch1 EMG interrupt
                DCD     INTEMG2_IRQHandler        ; 26:	A-PMD ch2 EMG interrupt
                DCD     INTOVV0_IRQHandler        ; 27:	A-PMD ch0 OVV interrupt
                DCD     INTOVV1_IRQHandler        ; 28:	A-PMD ch1 OVV interrupt
                DCD     INTOVV2_IRQHandler        ; 29:	A-PMD ch2 OVV interrupt
                DCD     INTPWM0_IRQHandler        ; 30:	A-PMD ch0 PWM interrupt
                DCD     INTPWM1_IRQHandler        ; 31:	A-PMD ch1 PWM interrupt
                DCD     INTPWM2_IRQHandler        ; 32:	A-PMD ch2 PWM interrupt
                DCD     INTENC00_IRQHandler       ; 33:	A-ENC32 ch0 Encoder interupt 0
                DCD     INTENC01_IRQHandler       ; 34:	A-ENC32 ch0 Encoder interupt 1
                DCD     INTENC10_IRQHandler       ; 35:	A-ENC32 ch1 Encoder interupt 0
                DCD     INTENC11_IRQHandler       ; 36:	A-ENC32 ch1 Encoder interupt 1
                DCD     INTENC20_IRQHandler       ; 37:	A-ENC32 ch2 Encoder interupt 0
                DCD     INTENC21_IRQHandler       ; 38:	A-ENC32 ch2 Encoder interupt 1
                DCD     INTADAPDA_IRQHandler      ; 39:	ADC unit A PMD trigger program interrupt A
                DCD     INTADAPDB_IRQHandler      ; 40:	ADC unit A PMD trigger program interrupt B
                DCD     INTADACP0_IRQHandler      ; 41:	ADC unit A Monitor function 0 interrupt
                DCD     INTADACP1_IRQHandler      ; 42:	ADC unit A Monitor function 1 interrupt
                DCD     INTADATRG_IRQHandler      ; 43:	ADC unit A General purpose trigger program interrupt
                DCD     INTADASGL_IRQHandler      ; 44:	ADC unit A Single program interrupt
                DCD     INTADACNT_IRQHandler      ; 45:	ADC unit A Continuity program interrupt
                DCD     INTADBPDA_IRQHandler      ; 46:	ADC unit B PMD trigger program interrupt A
                DCD     INTADBPDB_IRQHandler      ; 47:	ADC unit B PMD trigger program interrupt B
                DCD     INTADBCP0_IRQHandler      ; 48:	ADC unit B Monitor function 0 interrupt
                DCD     INTADBCP1_IRQHandler      ; 49:	ADC unit B Monitor function 1 interrupt
                DCD     INTADBTRG_IRQHandler      ; 50:	ADC unit B General purpose trigger program interrupt
                DCD     INTADBSGL_IRQHandler      ; 51:	ADC unit B Single program interrupt
                DCD     INTADBCNT_IRQHandler      ; 52:	ADC unit B Continuity program interrupt
                DCD     INTADCPDA_IRQHandler      ; 53:	ADC unit C PMD trigger program interrupt A
                DCD     INTADCPDB_IRQHandler      ; 54:	ADC unit C PMD trigger program interrupt B
                DCD     INTADCCP0_IRQHandler      ; 55:	ADC unit C Monitor function 0 interrupt
                DCD     INTADCCP1_IRQHandler      ; 56:	ADC unit C Monitor function 1 interrupt
                DCD     INTADCTRG_IRQHandler      ; 57:	ADC unit C General purpose trigger program interrupt
                DCD     INTADCSGL_IRQHandler      ; 58:	ADC unit C Single program interrupt
                DCD     INTADCCNT_IRQHandler      ; 59:	ADC unit C Continuity program interrupt
                DCD     INTSC0RX_IRQHandler       ; 60:	TSPI/UART ch0 Reception interrupt
                DCD     INTSC0TX_IRQHandler       ; 61:	TSPI/UART ch0 Transmit interrupt
                DCD     INTSC0ERR_IRQHandler      ; 62:	TSPI/UART ch0 Error interrupt
                DCD     INTSC1RX_IRQHandler       ; 63:	TSPI/UART ch1 Reception interrupt
                DCD     INTSC1TX_IRQHandler       ; 64:	TSPI/UART ch1 Transmit interrupt
                DCD     INTSC1ERR_IRQHandler      ; 65:	TSPI/UART ch1 Error interrupt
                DCD     INTSC2RX_IRQHandler       ; 66:	UART ch2 Reception interrupt
                DCD     INTSC2TX_IRQHandler       ; 67:	UART ch2 Transmit interrupt
                DCD     INTSC2ERR_IRQHandler      ; 68:	UART ch2 Error interrupt
                DCD     INTSC3RX_IRQHandler       ; 69:	UART ch3 Reception interrupt
                DCD     INTSC3TX_IRQHandler       ; 70:	UART ch3 Transmit interrupt
                DCD     INTSC3ERR_IRQHandler      ; 71:	UART ch3 Error interrupt
                DCD     INTI2C0_IRQHandler        ; 72:	I2C ch0 Interrupt
                DCD     INTI2C0AL_IRQHandler      ; 73:	I2C ch0 Arbitration lost detection interrupt
                DCD     INTI2C0BF_IRQHandler      ; 74:	I2C ch0 Bus free detection interrupt
                DCD     INTI2C0NA_IRQHandler      ; 75:	I2C ch0 NACK detection interrupt
                DCD     INTI2C1_IRQHandler        ; 76:	I2C ch1 Interrupt
                DCD     INTI2C1AL_IRQHandler      ; 77:	I2C ch1 Arbitration lost detection interrupt
                DCD     INTI2C1BF_IRQHandler      ; 78:	I2C ch1 Bus free detection interrupt
                DCD     INTI2C1NA_IRQHandler      ; 79:	I2C ch1 NACK detection interrupt
                DCD     INTCANGLB_IRQHandler      ; 80:	CAN Global interrupt
                DCD     INTCANRXD_IRQHandler      ; 81:	CAN Receive completion interrupt
                DCD     INTCANTXD_IRQHandler      ; 82:	CAN Transmit completion interrupt
                DCD     INTT32A00AC_IRQHandler    ; 83:	T32A ch0 TimmerA/C compare match detection / Over flow / under flow
                DCD     INTT32A00ACCAP0_IRQHandler; 84:	T32A ch0 TimmerA/C input capture 0
                DCD     INTT32A00ACCAP1_IRQHandler; 85:	T32A ch0 TimmerA/C input capture 1
                DCD     INTT32A00B_IRQHandler     ; 86:	T32A ch0 TimmerB compare match detection / Over flow / under flow
                DCD     INTT32A00BCAP0_IRQHandler ; 87:	T32A ch0 TimmerB input capture 0
                DCD     INTT32A00BCAP1_IRQHandler ; 88:	T32A ch0 TimmerB input capture 1
                DCD     INTT32A01AC_IRQHandler    ; 89:	T32A ch1 TimmerA/C compare match detection / Over flow / under flow
                DCD     INTT32A01ACCAP0_IRQHandler; 90:	T32A ch1 TimmerA/C input capture 0
                DCD     INTT32A01ACCAP1_IRQHandler; 91:	T32A ch1 TimmerA/C input capture 1
                DCD     INTT32A01B_IRQHandler     ; 92:	T32A ch1 TimmerB compare match detection / Over flow / under flow
                DCD     INTT32A01BCAP0_IRQHandler ; 93:	T32A ch1 TimmerB input capture 0
                DCD     INTT32A01BCAP1_IRQHandler ; 94:	T32A ch1 TimmerB input capture 1
                DCD     INTT32A02AC_IRQHandler    ; 95:	T32A ch2 TimmerA/C compare match detection / Over flow / under flow
                DCD     INTT32A02ACCAP0_IRQHandler; 96:	T32A ch2 TimmerA/C input capture 0
                DCD     INTT32A02ACCAP1_IRQHandler; 97:	T32A ch2 TimmerA/C input capture 1
                DCD     INTT32A02B_IRQHandler     ; 98:	T32A ch2 TimmerB compare match detection / Over flow / under flow
                DCD     INTT32A02BCAP0_IRQHandler ; 99:	T32A ch2 TimmerB input capture 0
                DCD     INTT32A02BCAP1_IRQHandler ; 100:	T32A ch2 TimmerB input capture 1
                DCD     INTT32A03AC_IRQHandler    ; 101:	T32A ch3 TimmerA/C compare match detection / Over flow / under flow
                DCD     INTT32A03ACCAP0_IRQHandler; 102:	T32A ch3 TimmerA/C input capture 0
                DCD     INTT32A03ACCAP1_IRQHandler; 103:	T32A ch3 TimmerA/C input capture 1
                DCD     INTT32A03B_IRQHandler     ; 104:	T32A ch3 TimmerB compare match detection / Over flow / under flow
                DCD     INTT32A03BCAP0_IRQHandler ; 105:	T32A ch3 TimmerB input capture 0
                DCD     INTT32A03BCAP1_IRQHandler ; 106:	T32A ch3 TimmerB input capture 1
                DCD     INTT32A04AC_IRQHandler    ; 107:	T32A ch4 TimmerA/C compare match detection / Over flow / under flow
                DCD     INTT32A04ACCAP0_IRQHandler; 108:	T32A ch4 TimmerA/C input capture 0
                DCD     INTT32A04ACCAP1_IRQHandler; 109:	T32A ch4 TimmerA/C input capture 1
                DCD     INTT32A04B_IRQHandler     ; 110:	T32A ch4 TimmerB compare match detection / Over flow / under flow
                DCD     INTT32A04BCAP0_IRQHandler ; 111:	T32A ch4 TimmerB input capture 0
                DCD     INTT32A04BCAP1_IRQHandler ; 112:	T32A ch4 TimmerB input capture 1
                DCD     INTT32A05AC_IRQHandler    ; 113:	T32A ch5 TimmerA/C compare match detection / Over flow / under flow
                DCD     INTT32A05ACCAP0_IRQHandler; 114:	T32A ch5 TimmerA/C input capture 0
                DCD     INTT32A05ACCAP1_IRQHandler; 115:	T32A ch5 TimmerA/C input capture 1
                DCD     INTT32A05B_IRQHandler     ; 116:	T32A ch5 TimmerB compare match detection / Over flow / under flow
                DCD     INTT32A05BCAP0_IRQHandler ; 117:	T32A ch5 TimmerB input capture 0
                DCD     INTT32A05BCAP1_IRQHandler ; 118:	T32A ch5 TimmerB input capture 1
                DCD     INTPARI0_IRQHandler       ; 119:	RAM parity ch0 Parity error interrupt
                DCD     INTPARI1_IRQHandler       ; 120:	RAM parity ch1 Parity error interrupt
                DCD     INTDMAATC_IRQHandler      ; 121:	DMA unit A End of transfer (ch0 - 31)
                DCD     INTDMAAERR_IRQHandler     ; 122:	DMA unit A Transfer error
                DCD     INTFLCRDY_IRQHandler      ; 123:	Code FLASH Ready interrupt
                DCD     INTFLDRDY_IRQHandler      ; 124:	Data FLASH Ready interrupt
                THUMB
; Dummy Exception Handlers (infinite loops which can be modified)

                PUBWEAK Reset_Handler
                SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0

                PUBWEAK NMI_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
                B       NMI_Handler

                PUBWEAK HardFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
                B       HardFault_Handler

                PUBWEAK MemManage_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
                B       MemManage_Handler

                PUBWEAK BusFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
                B       BusFault_Handler

