iarsystems/ewarm-toshiba-example-projects/TMPM4KN/Libraries/CMSIS/startup/iar/startup_TMPM4KN.s
                PUBWEAK INTENC10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTENC10_IRQHandler
                B       INTENC10_IRQHandler

                PUBWEAK INTENC11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTENC11_IRQHandler
                B       INTENC11_IRQHandler

                PUBWEAK INTENC20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTENC20_IRQHandler
                B       INTENC20_IRQHandler

                PUBWEAK INTENC21_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTENC21_IRQHandler
                B       INTENC21_IRQHandler

                PUBWEAK INTADAPDA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAPDA_IRQHandler
                B       INTADAPDA_IRQHandler

                PUBWEAK INTADAPDB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAPDB_IRQHandler
                B       INTADAPDB_IRQHandler

                PUBWEAK INTADACP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACP0_IRQHandler
                B       INTADACP0_IRQHandler

                PUBWEAK INTADACP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACP1_IRQHandler
                B       INTADACP1_IRQHandler

                PUBWEAK INTADATRG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADATRG_IRQHandler
                B       INTADATRG_IRQHandler

                PUBWEAK INTADASGL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADASGL_IRQHandler
                B       INTADASGL_IRQHandler

                PUBWEAK INTADACNT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACNT_IRQHandler
                B       INTADACNT_IRQHandler

                PUBWEAK INTADBPDA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBPDA_IRQHandler
                B       INTADBPDA_IRQHandler

                PUBWEAK INTADBPDB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBPDB_IRQHandler
                B       INTADBPDB_IRQHandler

                PUBWEAK INTADBCP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBCP0_IRQHandler
                B       INTADBCP0_IRQHandler

                PUBWEAK INTADBCP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBCP1_IRQHandler
                B       INTADBCP1_IRQHandler

                PUBWEAK INTADBTRG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBTRG_IRQHandler
                B       INTADBTRG_IRQHandler

                PUBWEAK INTADBSGL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBSGL_IRQHandler
                B       INTADBSGL_IRQHandler

                PUBWEAK INTADBCNT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADBCNT_IRQHandler
                B       INTADBCNT_IRQHandler

                PUBWEAK INTADCPDA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCPDA_IRQHandler
                B       INTADCPDA_IRQHandler

                PUBWEAK INTADCPDB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCPDB_IRQHandler
                B       INTADCPDB_IRQHandler

                PUBWEAK INTADCCP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCCP0_IRQHandler
                B       INTADCCP0_IRQHandler

                PUBWEAK INTADCCP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCCP1_IRQHandler
                B       INTADCCP1_IRQHandler

                PUBWEAK INTADCTRG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCTRG_IRQHandler
                B       INTADCTRG_IRQHandler

                PUBWEAK INTADCSGL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCSGL_IRQHandler
                B       INTADCSGL_IRQHandler

                PUBWEAK INTADCCNT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADCCNT_IRQHandler
                B       INTADCCNT_IRQHandler

                PUBWEAK INTSC0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC0RX_IRQHandler
                B       INTSC0RX_IRQHandler

                PUBWEAK INTSC0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC0TX_IRQHandler
                B       INTSC0TX_IRQHandler

                PUBWEAK INTSC0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC0ERR_IRQHandler
                B       INTSC0ERR_IRQHandler

                PUBWEAK INTSC1RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC1RX_IRQHandler
                B       INTSC1RX_IRQHandler

                PUBWEAK INTSC1TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC1TX_IRQHandler
                B       INTSC1TX_IRQHandler

                PUBWEAK INTSC1ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC1ERR_IRQHandler
                B       INTSC1ERR_IRQHandler

                PUBWEAK INTSC2RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC2RX_IRQHandler
                B       INTSC2RX_IRQHandler

                PUBWEAK INTSC2TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC2TX_IRQHandler
                B       INTSC2TX_IRQHandler

                PUBWEAK INTSC2ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC2ERR_IRQHandler
                B       INTSC2ERR_IRQHandler

                PUBWEAK INTSC3RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC3RX_IRQHandler
                B       INTSC3RX_IRQHandler

                PUBWEAK INTSC3TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC3TX_IRQHandler
                B       INTSC3TX_IRQHandler

                PUBWEAK INTSC3ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSC3ERR_IRQHandler
                B       INTSC3ERR_IRQHandler

